{
  "standard": {
    "id": "standard",
    "name": "Ontario ADU Master Plan",
    "description": "A comprehensive, step-by-step roadmap for building an Accessory Dwelling Unit in Ontario. Covers feasibility, design, permits, and construction.",
    "tasks": [
      {
        "title": "1.1 Check Zoning & Setbacks",
        "offset_days": 1,
        "description": "Verify your property's eligibility for an ADU. Check your municipality's zoning bylaw for 'Secondary Dwelling Units' or 'Garden Suites'. Key metrics: Rear yard setback (usually 0.6m - 1.5m), lot coverage (max % of lot area), and building height. Action: Visit your city's planning website or call the zoning desk.",
        "diy_guidance": "You can do this entirely yourself for free. Use your property survey and the online zoning map to measure distances. No need to hire a planner yet unless your lot is complex.",
        "cost_savings": "$300 - $1,000 (Planner Consultation)"
      },
      { 
        "title": "1.2 Locate or Order Survey", 
        "offset_days": 5,
        "description": "A legal survey is required for design and permits. It shows exact property lines. Action: Check your purchase documents for an existing survey. If none, hire a Land Surveyor.",
        "diy_guidance": "Save money by finding the iron survey bars on your property corners yourself and clearing brush around them. You can also buy a copy of an old survey from LandRegistry.ca (~$30) which might suffice for preliminary design, though a new one is often needed for the final permit.",
        "cost_savings": "$300 (Surveyor Hourly Savings)"
      },
      {
        "title": "2.1 Create Site Plan",
        "offset_days": 15,
        "description": "Draw a 'Site Plan' showing your lot, existing house, and the proposed ADU. Must include dimensions, setbacks to property lines, and location of services. Action: Draw this to scale (e.g., 1/4\" = 1').",
        "diy_guidance": "You can draw this yourself! Use graph paper or free software like SketchUp. As long as it is legible, to scale, and accurate, the city will accept it for simple projects.",
        "cost_savings": "$500 - $1,500 (Drafting Fees)"
      },
      {
        "title": "2.2 Design Floor Plans & Elevations",
        "offset_days": 25,
        "description": "Create detailed drawings of the ADU: Floor plans, 4 exterior elevations, and cross-sections. Must show compliance with Ontario Building Code (OBC). Action: Define room sizes, window locations, and insulation details.",
        "diy_guidance": "Under the BCIN exemption, you are legally allowed to design your own home/ADU in Ontario. You assume full responsibility for code compliance. If you are detail-oriented and willing to learn the OBC, you can skip the designer.",
        "cost_savings": "$3,000 - $8,000 (Designer Fees)"
      },
      {
        "title": "2.3 HVAC Heat Loss Calculation",
        "offset_days": 35,
        "description": "Commission a Heat Loss/Heat Gain calculation and Ventilation design. This ensures your heating system is sized correctly. Action: Hire a licensed HVAC designer (BCIN holder). This is rarely a DIY task.",
        "diy_guidance": "While difficult to DIY, you can save money by providing the HVAC designer with perfect, clear plans so they don't have to redraw them.",
        "cost_savings": "Minimal"
      },
      {
        "title": "3.1 Submit Permit Application",
        "offset_days": 45,
        "description": "Compile your package: Application to Construct form, Schedule 1, Site Plan, Drawings, and HVAC calc. Action: Submit to your municipality's building portal and pay the intake fee.",
        "diy_guidance": "Be your own applicant. Fill out the forms yourself. Agents charge a premium just to stand in line or upload files for you.",
        "cost_savings": "$500 - $1,500 (Permit Runner Fees)"
      },
      {
        "title": "4.1 Create Scope of Work",
        "offset_days": 60,
        "description": "Write a detailed list of exactly what needs to be built. Include materials (e.g., 'Vinyl siding, color gray', 'Laminate flooring'). Action: Create a spreadsheet listing every task to send to contractors.",
        "diy_guidance": "The more detailed your scope, the more accurate your quotes. Doing this yourself puts you in control and prevents 'extras' later.",
        "cost_savings": "$1,000+ (Project Management)"
      },
      {
        "title": "4.2 Request Contractor Quotes",
        "offset_days": 65,
        "description": "Send your Scope of Work and Drawings to at least 3 contractors. Action: Schedule site visits and ask for fixed-price quotes.",
        "diy_guidance": "Manage the tender process yourself. You are effectively the Project Manager. Compare line items carefully.",
        "cost_savings": "10% - 15% (PM Fee)"
      },
      {
        "title": "5.1 Site Prep & Demolition",
        "offset_days": 90,
        "description": "Prepare the area for construction. Remove sheds, trees (if permitted), decks, or debris. Action: Clear the workspace completely.",
        "diy_guidance": "High sweat equity potential! You can do all the clearing, fence removal, and basic demolition yourself. Rent a bin and fill it up.",
        "cost_savings": "$1,000 - $3,000 (General Labour)"
      },
      {
        "title": "5.2 Excavation & Foundation",
        "offset_days": 100,
        "description": "Digging the hole and pouring concrete. Action: Coordinate the excavator and formwork crew. Ensure municipal inspection happens BEFORE pouring concrete.",
        "diy_guidance": "Act as GC: Hire the excavator and concrete crew directly rather than paying a builder to call them.",
        "cost_savings": "20% markup on subs"
      },
      {
        "title": "5.3 Framing & Shell",
        "offset_days": 115,
        "description": "Building the wood structure, roof, and installing windows/doors. Action: Reach 'Lock-up' stage where the building is weather-tight.",
        "diy_guidance": "You can assist with moving lumber and site cleanup. Installing windows can be DIY if you are handy, but framing the roof is best left to pros.",
        "cost_savings": "$500 - $2,000 (Helper Labour)"
      },
      {
        "title": "6.1 Rough-in Inspections",
        "offset_days": 130,
        "description": "Plumbing, Electrical, and HVAC systems installed inside walls. Action: Call for 'Rough-in' inspections (Building + ESA for electrical). Do not drywall until passed.",
        "diy_guidance": "You can run your own electrical (ESA permits homeowner permits) if you own and live in the property, but rules are strict. Plumbing is harder to DIY legally/safely.",
        "cost_savings": "$3,000+ (If DIY Electrical)"
      },
      {
        "title": "7.1 Insulation & Vapor Barrier",
        "offset_days": 135,
        "description": "Install batts/spray foam and the vapor barrier. Action: Ensure continuity of the air barrier. Call for Insulation Inspection.",
        "diy_guidance": "Very DIY-able. Batt insulation is easy to install. Wear protective gear. Save huge on labour.",
        "cost_savings": "$1,500 - $2,500"
      },
      {
        "title": "7.2 Drywall & Taping",
        "offset_days": 145,
        "description": "Boarding walls and ceilings, taping joints, and sanding. Action: Create smooth, paint-ready surfaces.",
        "diy_guidance": "A classic DIY task. Hanging board is heavy but simple. Taping requires skill to look good—consider hiring a taper if you want a perfect finish, but hanging yourself saves money.",
        "cost_savings": "$2,000 - $4,000"
      },
      {
        "title": "7.3 Flooring & Painting",
        "offset_days": 155,
        "description": "Install finish flooring and paint walls/trim. Action: Lay laminate/vinyl and apply 2 coats of paint.",
        "diy_guidance": "100% DIY territory. Vinyl plank flooring clicks together easily. Painting is the highest return-on-effort DIY task.",
        "cost_savings": "$2,500 - $5,000"
      },
      {
        "title": "8.1 Final Inspections & Occupancy",
        "offset_days": 170,
        "description": "Final building inspection, ESA final, and closing permits. Action: Walk through with the inspector. Obtain Occupancy Permit.",
        "diy_guidance": "Coordinate this yourself. Ensure all paperwork (HVAC balance sheets, ESA cert) is on site.",
        "cost_savings": "Time & Org"
      }
    ],
    "milestones": [
      { "title": "Feasibility Confirmed", "offset_days": 14, "status": "Pending" },
      { "title": "Permit Application Submitted", "offset_days": 45, "status": "Pending" },
      { "title": "Permit Issued", "offset_days": 75, "status": "Pending" },
      { "title": "Lock-Up (Shell Complete)", "offset_days": 120, "status": "Upcoming" },
      { "title": "Occupancy Granted", "offset_days": 180, "status": "Upcoming" }
    ]
  },
  "catalogue": {
    "id": "catalogue",
    "name": "Catalogue Design",
    "description": "Plan aligned to a selected catalogue design, with review and permit steps.",
    "tasks": [
      { 
        "title": "Select Catalogue Design", 
        "offset_days": 3,
        "description": "Browse the design catalogue and choose a model that fits your lot and budget. Consider the orientation of windows and access to the unit. Action: Purchase the design license or download the preliminary set to check fit.",
        "diy_guidance": "Using a pre-made catalogue design is effectively the 'DIY' of the design world compared to custom architecture. You save significantly by reusing plans.",
        "cost_savings": "70% vs Custom Architect Fees"
      },
      { 
        "title": "Design Review with Architect", 
        "offset_days": 14,
        "description": "Even pre-made designs need a site plan to show where they sit on your specific lot. Engage a local designer to prepare the 'Site Plan' and ensure the foundation matches your soil conditions. Action: Send your chosen design and your site survey to a local designer.",
        "diy_guidance": "You can draw the Site Plan yourself if you are comfortable with CAD or even neat hand drawing (depending on municipality). You must accurately plot setbacks and lot coverage.",
        "cost_savings": "$500 - $1,500"
      },
      { 
        "title": "Apply for Permits", 
        "offset_days": 21,
        "description": "Submit the full package (Catalogue Drawings + Site Plan + Forms) to your municipality. You will need to pay the permit fee. Action: Go to your city's building portal or service counter to submit the application, then upload the receipt to Documents.",
        "diy_guidance": "Many people hire 'permit runners' or agents. You can absolutely do this yourself. It involves filling out the forms (e.g., 'Application for a Permit to Construct or Demolish') and waiting in line or uploading files.",
        "cost_savings": "$600 - $1,200 (Agent Fees)"
      },
      { 
        "title": "Contractor Tender & Quotes", 
        "offset_days": 28,
        "description": "Send your permit-ready drawings to contractors to get firm construction quotes. Do not rely on estimates; get a fixed-price contract. Action: Email your drawings to 3 contractors and ask for a quote within 2 weeks.",
        "diy_guidance": "This is Project Management 101. By finding, vetting, and comparing contractors yourself, you avoid paying a Project Manager.",
        "cost_savings": "10% of Project Value (PM Fees)"
      }
    ],
    "milestones": [
      { "title": "Design Selected", "offset_days": 7, "status": "Pending" },
      { "title": "Quotes Received", "offset_days": 35, "status": "Pending" }
    ]
  },
  "custom": {
    "id": "custom",
    "name": "Custom Plan",
    "description": "Start with an empty plan and add tasks that match your project needs.",
    "tasks": [],
    "milestones": []
  }
}
